#Запись в файлы
#1 - запись в файл
#2 - чтение файла
#3 - перезапись файла
#
# with open('text2.docx', encoding='utf-8')as read_file:
#                 print(read_file.read())

#запись в файл
# with open('text2.txt', 'w')as file:
#     print(file.write('Пора, мой друг, пора! покоя сердце просит —\n\
# Летят за днями дни, и каждый час уносит\n\
# Частичку бытия, а мы с тобой вдвоем\n\
# Предполагаем жить, и глядь — как раз умрем.\n\
# На свете счастья нет, но есть покой и воля.\n\
# Давно завидная мечтается мне доля — \n\
# Давно, усталый раб, замыслил я побег\n\
# В обитель дальную трудов и чистых нег.'))


#добавление текста в файл
# with open('text2.txt', 'a')as file:
#     print(file.write('\n'
#                      'Максим Радомир \n'
#                      'jcdbkjdbkjcbkjebdkcdec'))